Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F30A.tmx
Source language: en_us
Languages: zh_cn

source: Why do animals like to play?
zh_cn: 动物为何喜欢玩耍？

source: Recreation may look like it serves no obvious purpose, but when dogs and other animals are having fun they are learning some valuable lessons.
zh_cn: 娱乐消遣看似没有任何明显的目的性，但是当狗和其他动物在玩耍时，却在学习重要知识。

source: Say you're walking your dog in the park, when he comes face to snout with another dog. An intricate dance begins, as if each movement was precisely choreographed.
zh_cn: 比如，你在公园遛狗，它用鼻子闻另一只狗时，一场复杂的舞蹈将开始了，好像每个动作都是精心设计的一样。

source: The dogs visually inspect each other, sniff each other, walk circles around each other.
zh_cn: 狗狗们目视彼此，嗅闻彼此，围着彼此转圈。

source: And then the fight begins.
zh_cn: 然后，战斗就打响了。

source: But is it really a fight, or is it just play-fighting?
zh_cn: 但是，这是真正战斗，还只是玩斗呢？

source: It's very important for Fido and you to know whether he's in any true danger.
zh_cn: 知道它是否面对任何真正危险对Fido和你来说非常重要。

source: Dog owners everywhere like to take their dogs to the park to play.
zh_cn: 每个地方的狗主人都喜欢带他们的狗狗去公园玩耍。

source: But is their behaviour best described as "play"?
zh_cn: 但是，它们的行为是不是最好用“玩”来描写？

source: Scientists, such as James L. Gould and Carol Grant Gould have used the word "play" to describe any behaviour that does not have any apparent adaptive function, that is, it serves no obvious purpose.
zh_cn: 像詹姆斯·L·歌尔德（James L. Gould）和卡罗尔·格兰特·歌尔德（Carol Grant Gloud）等科学家已经用“玩”这个词来描述那些没有任何明显适应功能的任何行为，也就是说，没有明显目的的行为

source: The natural world teems with examples of such "purposeless activities."
zh_cn: 自然界有许多这种“无意义活动”的例子。

source: University of Vermont biologists Bernd Heinrich and Rachel Smolker describe a commonplace activity among ravens (Corvus corax): snowboarding.
zh_cn: 佛蒙特大学的生物学家贝恩德·亨瑞克（Bernd Heinrich）和雷切尔·斯摩克尔（Rachel Smolker）描写了乌鸦们的常见活动：滑雪。

source: Ravens in Alaska and Northern Canada are known to slide down steep, snow-covered roofs.
zh_cn: 阿拉斯加和加拿大北部的乌鸦因从陡峭冰雪覆盖的屋顶上滑下而出名。

source: When they reach the bottom, they walk or fly back to the top, and repeat the process over and over again.
zh_cn: 当它们到达底部，又走回或飞回顶部，又一遍遍重复此前的动作。

source: In Maine, ravens were observed tumbling down small mounds of snow, sometimes while holding sticks between their talons.
zh_cn: 在缅因州（Maine），观察到乌鸦翻液下小雪球，有时尽管它们爪子上还抓着树枝。

source: "We see no obvious utilitarian function for sliding behaviour," they write.
zh_cn: “我们没有看到滑雪行为的任何功利性功能，”他们写道。

source: Anyone who has spent time in a school playground will recognize that ravens and human children both delight in this type of repetitive sliding activity.
zh_cn: 在学校操场玩过的人都会认为乌鸦和人类孩子们都沉迷在这种重复性的滑活动快乐之中。

source: Herring gulls (Larus argentatus), too, like to play, but it's not them that take any risks.
zh_cn: 银鸥（Herring gulls），也喜欢玩，但是不像它们那样冒险。

source: These shorebirds feed on clams by dropping them onto hard surfaces such as rocks or paved roads.
zh_cn: 这些海滨鸟以蛤蚌为生，将蛤蚌掉落在如岩石或路石等坚硬表面。

source: If they drop them from high enough, the clamshell might crack, providing access to the juicy snack waiting inside.
zh_cn: 如果它们从足够高的地方扔下蛤蚌，蛤蚌外壳就可能破裂，就可以吃等待已久的内部多汁的肉。

source: Sometimes, rather than letting clams drop to the ground, herring gulls try to catch the clam in mid-air.
zh_cn: 有时，为了不让蛤蚌掉到地面上，它们就在半空中接住。

source: Other shorebirds play this game of catch as well, including black-backed gulls, common gulls, and Pacific gulls.
zh_cn: 其他的海鸟也玩这个抓放游戏，包括黑背鸥、普通鸥和太平洋海鸥。

source: After observing herring gulls for eighty hours, researchers Jennifer R. Gamble and Daniel A. Cristol from the College of William and Mary in Williamsburg, Virginia, formulated some "rules" of the game.
zh_cn: 在观察银鸥80个小时后，来自美国弗吉尼亚州威廉斯堡的威廉与玛丽学院的研究员詹尼佛·R·干博尔（Jennifer R. Gamble）和丹尼尔·A.克里斯特（Daniel A. Cristol）对此种游戏形成了某种“规则”。

source: They found that younger gulls played drop-catch more often than mature gulls.
zh_cn: 他们发现年幼的海鸥比成年海鸥接得更多。

source: They also found that the drop-catch was performed over soft ground more often than over hard or rocky surfaces.
zh_cn: 他们也发现落—接动作在软地比在硬地或岩石表面进行得更频繁些。

source: In other words, if the gull had dropped the clams on the softer ground, it was extremely unlikely that they would break open.
zh_cn: 也就是说，如果海鸥将蛤蚌扔在较软的地面上，就很可能不会破裂开。

source: They also noticed that drop-catch behaviour was far more likely to occur when the gull was carrying an object that wasn't a clam.
zh_cn: 他们同时也注意到当它们携带的物体不是蛤蚌时，落—接动作就可能出现得更多些。

source: And drop-catched clams were less likely to be eaten than dropped ones.
zh_cn: 而且落—接的蛤蚌比直接扔下去的被吃的可能性要小些。

source: Most interesting was that drop-catches were more common when the wind was stronger, providing a provocative hint that this may be more enjoyable for gulls when it is a more challenging task.
zh_cn: 最有趣的是当风强些时，落—接会更常见，提供一个争论性的暗示：当任务具有挑战性时，对海鸥来说更好玩。

source: It may be that drop-catching gulls are simply having fun.
zh_cn: 这说明落—接中海鸥正在玩耍。

source: Practice makes perfect
zh_cn: 熟能生巧

source: Both the snowboarding ravens and the drop-catching gulls are examples of solitary play, but social play is also common.
zh_cn: 滑雪乌鸦和落接海鸥都是独自游戏的例子，但是社会游戏也是常见的。

source: This brings us back to the dog park play-fight, and another important aspect of animal play, which ethologist Robert Fagen described as being "specific signal patterns."
zh_cn: 这又将我们带回到狗狗们公园玩斗了，是动物们玩耍的另一个重要方面，动物行为学家罗伯特·费根（Robert Fagen）把这描述成“具体信号型”。

source: Dogs and their canid cousins, wolves and coyotes, bow their heads down - a signal that psychologist Marc Bekoff calls a "play bow."
zh_cn: 狗狗们和它们犬科动物表亲，狼和土狼把它们头低下——心理学家马克·贝克夫（Marc Bekoff）将这一信号称为“邀玩动作 “。

source: The play bow, like other signals, serves as a means of broadcasting the message, "I want to play!"
zh_cn: 像其它信号一样，邀玩动作作为一种信息传递方式，”我想玩！“

source: They serve another important function: they maintain on-going play.
zh_cn: 它们还有另一重要功能： 它们保持持续玩耍。

source: This is important, since several behaviours used during play are also used in other contexts, like aggressive, predatory, and sexual encounters.
zh_cn: 这很重要，因为玩过程中使用的几个行为也会在其他情境下使用，比如，战斗、夺食和交配。

source: In fact, Bekoff found that the bow is used more often before and after actions that could be misinterpreted as non-playful - infant and adult dogs used the play bow directly before and after mock bites 74% of the time, juvenile wolves 79% of the time, and young coyotes 92% of the time.
zh_cn: 实际上，贝克夫发现邀玩动作多用于当作被曲解为不玩时前后——年幼和成年狗狗在模拟撕咬74%时间前后进行邀玩动作，幼年狼79%的时间，年轻土狼92%的时间。

source: It is easy to see that play may sometimes have a purpose that is perhaps masked by the lack of any adaptive or evolutionary function.
zh_cn: 很容易看到有时玩耍也是有目的性的，目的也许因为缺乏适应或进化功能而被掩盖掉了。

source: Given that young animals borrow actions from aggressive, hunting, foraging, or sexual behaviours, play may serve as a form of practice.
zh_cn: 假如年经动物们从战斗、狩猎、觅食或者性行为中借用动作，那么玩耍就是一种实践的方式。

source: Play might help animals become more psychologically flexible.
zh_cn: 玩可能会帮助动物们心理上变得更加灵活。

source: Fagen argues that: "the distinctive aspect of playful practice and learning is that they are generic and variational, requiring varied experiences and stressing interactions between simple components."
zh_cn: 费根认为：”好玩的实践和学习特色是它们通用且变化的，需要各种经验并强调简单动作间的交互使用。

source: If this is the case, then perhaps the variation within "play actions" may better prepare an animal to respond adequately in future aggressive or sexual encounters.
zh_cn: “如果是这样，那么也许”玩动作“间的变化可能更好地让动物去有效应对将来的战斗和交配。

source: So next time you walk by a playground or schoolyard, take a look around.
zh_cn: 因此，下次你经过游乐场或学校操场时，四处看看。

source: The kinds of games that young children play may echo simpler forms of play seen in animals as different from us as seagulls and coyotes.
zh_cn: 小孩子玩的游戏可能反映动物里看到的与我们不同的海鸥及土狼简单玩耍形式。

source: Some children may remind you of the drop-catching seagull or snowboarding raven, just trying to have a good time.
zh_cn: 有些小孩可能让你想起落接的海鸥或滑雪乌鸦，仅是为了好玩。

source: Other games, though, might have a deeper purpose, helping children learn their place in the social world within which they live.
zh_cn: 其他游戏可能有更深层的目的，帮助孩子学习他们所生活的社会世界的角色。
